app/views/home/index.html.erb

SELECT COUNT(*) AS count_all, category AS category FROM `products` GROUP BY category
SELECT `products`.* FROM `products` WHERE `products`.`category` = 'Classic'
---

<% Product.group(:category).size.each do |category| %>

SELECT `variants`.* FROM `variants` WHERE `variants`.`product_id` = 1
---
				<td><span class="product_name"><%= product.name %></span><br/><%= product.description %></td>
				<% product.variants.each do |variant| %>

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
SELECT COUNT(*) AS count_all, product_id AS product_id FROM `variants` GROUP BY product_id
---
	<script>
		$(".qty").change(function(){
			var total = 0;
			var amt = ($("input[name='item']:checked").val());
			var product_id = $(this).parent().prev().children().data('product');
			$(this).parent().siblings().find('#order_item_total').val(($(this).val() * amt));
		});

		$(".item").change(function(){
			var total = 0;
			var product_id = $(this).data('product');
			$(this).parent().siblings().find('#order_item_quantity').val('1');
			$(this).parent().siblings().find('#order_item_variant_id').val($(this).data('variant'));
			var amt = ($("input[name='item']:checked").val());

			if($(this).parent().siblings().find('#order_item_quantity').val()==0){
				$(this).parent().siblings().find('#order_item_quantity').val(1);
			}
			var qty = ($(this).parent().siblings().find('#order_item_quantity').val());
			$(this).parent().siblings().find('#order_item_total').val(qty * amt);
		});